AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/mcu/apollo5b/regs/am_mcu_apollo5b_mraminfo1.h
// AUDADC_A1_LG_OFFSET - This is the float value for low gain offset (less than 12dB). A1 maps to Slot 1
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET_S 0
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET_Pos 0
#define AM_REG_INFO1_AUDADC_A1_LG_OFFSET_LGOFFSET_Msk 0xFFFFFFFF

// AUDADC_A1_HG_SLOPE - This is the float value for high gain slope (more than 12dB). A1 maps to Slot 1
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE_S 0
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE_Pos 0
#define AM_REG_INFO1_AUDADC_A1_HG_SLOPE_HGSLOPE_Msk 0xFFFFFFFF

// AUDADC_A1_HG_INTERCEPT - This is the float value for high gain intercept (more than 12dB). A1 maps to Slot 1
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT_S 0
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT_Pos 0
#define AM_REG_INFO1_AUDADC_A1_HG_INTERCEPT_HGINTERCEPT_Msk 0xFFFFFFFF

// AUDADC_B0_LG_OFFSET - This is the float value for low gain offset (less than 12dB). B0 maps to Slot 2
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET_S 0
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET_Pos 0
#define AM_REG_INFO1_AUDADC_B0_LG_OFFSET_LGOFFSET_Msk 0xFFFFFFFF

// AUDADC_B0_HG_SLOPE - This is the float value for high gain slope (more than 12dB). B0 maps to Slot 2
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE_S 0
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE_Pos 0
#define AM_REG_INFO1_AUDADC_B0_HG_SLOPE_HGSLOPE_Msk 0xFFFFFFFF

// AUDADC_B0_HG_INTERCEPT - This is the float value for high gain intercept (more than 12dB). B0 maps to Slot 2
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT_S 0
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT_Pos 0
#define AM_REG_INFO1_AUDADC_B0_HG_INTERCEPT_HGINTERCEPT_Msk 0xFFFFFFFF

// AUDADC_B1_LG_OFFSET - This is the float value for low gain offset (less than 12dB). B1 maps to Slot 3
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET_S 0
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET_Pos 0
#define AM_REG_INFO1_AUDADC_B1_LG_OFFSET_LGOFFSET_Msk 0xFFFFFFFF

// AUDADC_B1_HG_SLOPE - This is the float value for high gain slope (more than 12dB). B1 maps to Slot 3
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE_S 0
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE_Pos 0
#define AM_REG_INFO1_AUDADC_B1_HG_SLOPE_HGSLOPE_Msk 0xFFFFFFFF

// AUDADC_B1_HG_INTERCEPT - This is the float value for high gain intercept (more than 12dB). B1 maps to Slot 3
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT_S 0
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT_M 0xFFFFFFFF
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT_Pos 0
#define AM_REG_INFO1_AUDADC_B1_HG_INTERCEPT_HGINTERCEPT_Msk 0xFFFFFFFF

// POWERSTATE0 - Power state register. CPU LP mode, GPU off, XYZ peripherals off. Temperature range greater than 50C.
#define AM_REG_INFO1_POWERSTATE0_RESVD29_S 29
#define AM_REG_INFO1_POWERSTATE0_RESVD29_M 0xE0000000
#define AM_REG_INFO1_POWERSTATE0_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_INFO1_POWERSTATE0_RESVD29_Pos 29
#define AM_REG_INFO1_POWERSTATE0_RESVD29_Msk 0xE0000000
#define AM_REG_INFO1_POWERSTATE0_TVRGCVREFSEL_S 28
#define AM_REG_INFO1_POWERSTATE0_TVRGCVREFSEL_M 0x10000000
#define AM_REG_INFO1_POWERSTATE0_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_INFO1_POWERSTATE0_TVRGCVREFSEL_Pos 28
#define AM_REG_INFO1_POWERSTATE0_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_INFO1_POWERSTATE0_TVRGCACTTRIM_S 21
#define AM_REG_INFO1_POWERSTATE0_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_INFO1_POWERSTATE0_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_INFO1_POWERSTATE0_TVRGCACTTRIM_Pos 21
#define AM_REG_INFO1_POWERSTATE0_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_INFO1_POWERSTATE0_CORELDOTEMPCOTRIM_S 17
#define AM_REG_INFO1_POWERSTATE0_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_INFO1_POWERSTATE0_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_INFO1_POWERSTATE0_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_INFO1_POWERSTATE0_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_INFO1_POWERSTATE0_CORELDOACTTRIM_S 7
#define AM_REG_INFO1_POWERSTATE0_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_INFO1_POWERSTATE0_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_INFO1_POWERSTATE0_CORELDOACTTRIM_Pos 7
#define AM_REG_INFO1_POWERSTATE0_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_INFO1_POWERSTATE0_TVRGFACTTRIM_S 0
#define AM_REG_INFO1_POWERSTATE0_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_INFO1_POWERSTATE0_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_INFO1_POWERSTATE0_TVRGFACTTRIM_Pos 0
#define AM_REG_INFO1_POWERSTATE0_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE1 - Power state register. CPU LP mode, GPU off, XYZ peripherals off. Temperature range 0C to 50C.
#define AM_REG_INFO1_POWERSTATE1_RESVD29_S 29
#define AM_REG_INFO1_POWERSTATE1_RESVD29_M 0xE0000000
#define AM_REG_INFO1_POWERSTATE1_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_INFO1_POWERSTATE1_RESVD29_Pos 29
#define AM_REG_INFO1_POWERSTATE1_RESVD29_Msk 0xE0000000
#define AM_REG_INFO1_POWERSTATE1_TVRGCVREFSEL_S 28
#define AM_REG_INFO1_POWERSTATE1_TVRGCVREFSEL_M 0x10000000
#define AM_REG_INFO1_POWERSTATE1_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_INFO1_POWERSTATE1_TVRGCVREFSEL_Pos 28
#define AM_REG_INFO1_POWERSTATE1_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_INFO1_POWERSTATE1_TVRGCACTTRIM_S 21
#define AM_REG_INFO1_POWERSTATE1_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_INFO1_POWERSTATE1_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_INFO1_POWERSTATE1_TVRGCACTTRIM_Pos 21
#define AM_REG_INFO1_POWERSTATE1_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_INFO1_POWERSTATE1_CORELDOTEMPCOTRIM_S 17
#define AM_REG_INFO1_POWERSTATE1_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_INFO1_POWERSTATE1_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_INFO1_POWERSTATE1_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_INFO1_POWERSTATE1_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_INFO1_POWERSTATE1_CORELDOACTTRIM_S 7
#define AM_REG_INFO1_POWERSTATE1_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_INFO1_POWERSTATE1_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_INFO1_POWERSTATE1_CORELDOACTTRIM_Pos 7
#define AM_REG_INFO1_POWERSTATE1_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_INFO1_POWERSTATE1_TVRGFACTTRIM_S 0
#define AM_REG_INFO1_POWERSTATE1_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_INFO1_POWERSTATE1_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_INFO1_POWERSTATE1_TVRGFACTTRIM_Pos 0
#define AM_REG_INFO1_POWERSTATE1_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE2 - Power state register. CPU LP mode, GPU off, XYZ peripherals off. Temperature range -20C to 0C.
#define AM_REG_INFO1_POWERSTATE2_RESVD29_S 29
#define AM_REG_INFO1_POWERSTATE2_RESVD29_M 0xE0000000
#define AM_REG_INFO1_POWERSTATE2_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_INFO1_POWERSTATE2_RESVD29_Pos 29
#define AM_REG_INFO1_POWERSTATE2_RESVD29_Msk 0xE0000000
#define AM_REG_INFO1_POWERSTATE2_TVRGCVREFSEL_S 28
#define AM_REG_INFO1_POWERSTATE2_TVRGCVREFSEL_M 0x10000000
#define AM_REG_INFO1_POWERSTATE2_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_INFO1_POWERSTATE2_TVRGCVREFSEL_Pos 28
#define AM_REG_INFO1_POWERSTATE2_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_INFO1_POWERSTATE2_TVRGCACTTRIM_S 21
#define AM_REG_INFO1_POWERSTATE2_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_INFO1_POWERSTATE2_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_INFO1_POWERSTATE2_TVRGCACTTRIM_Pos 21
#define AM_REG_INFO1_POWERSTATE2_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_INFO1_POWERSTATE2_CORELDOTEMPCOTRIM_S 17
#define AM_REG_INFO1_POWERSTATE2_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_INFO1_POWERSTATE2_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_INFO1_POWERSTATE2_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_INFO1_POWERSTATE2_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_INFO1_POWERSTATE2_CORELDOACTTRIM_S 7
#define AM_REG_INFO1_POWERSTATE2_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_INFO1_POWERSTATE2_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_INFO1_POWERSTATE2_CORELDOACTTRIM_Pos 7
#define AM_REG_INFO1_POWERSTATE2_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_INFO1_POWERSTATE2_TVRGFACTTRIM_S 0
#define AM_REG_INFO1_POWERSTATE2_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_INFO1_POWERSTATE2_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_INFO1_POWERSTATE2_TVRGFACTTRIM_Pos 0
#define AM_REG_INFO1_POWERSTATE2_TVRGFACTTRIM_Msk 0x0000007F

// POWERSTATE3 - Power state register. CPU LP mode, GPU off, XYZ peripherals off. Temperature range -40C to -20C.
#define AM_REG_INFO1_POWERSTATE3_RESVD29_S 29
#define AM_REG_INFO1_POWERSTATE3_RESVD29_M 0xE0000000
#define AM_REG_INFO1_POWERSTATE3_RESVD29(n) (((uint32_t)(n) << 29) & 0xE0000000)
#define AM_REG_INFO1_POWERSTATE3_RESVD29_Pos 29
#define AM_REG_INFO1_POWERSTATE3_RESVD29_Msk 0xE0000000
#define AM_REG_INFO1_POWERSTATE3_TVRGCVREFSEL_S 28
#define AM_REG_INFO1_POWERSTATE3_TVRGCVREFSEL_M 0x10000000
#define AM_REG_INFO1_POWERSTATE3_TVRGCVREFSEL(n) (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_INFO1_POWERSTATE3_TVRGCVREFSEL_Pos 28
#define AM_REG_INFO1_POWERSTATE3_TVRGCVREFSEL_Msk 0x10000000
#define AM_REG_INFO1_POWERSTATE3_TVRGCACTTRIM_S 21
#define AM_REG_INFO1_POWERSTATE3_TVRGCACTTRIM_M 0x0FE00000
#define AM_REG_INFO1_POWERSTATE3_TVRGCACTTRIM(n) (((uint32_t)(n) << 21) & 0x0FE00000)
#define AM_REG_INFO1_POWERSTATE3_TVRGCACTTRIM_Pos 21
#define AM_REG_INFO1_POWERSTATE3_TVRGCACTTRIM_Msk 0x0FE00000
#define AM_REG_INFO1_POWERSTATE3_CORELDOTEMPCOTRIM_S 17
#define AM_REG_INFO1_POWERSTATE3_CORELDOTEMPCOTRIM_M 0x001E0000
#define AM_REG_INFO1_POWERSTATE3_CORELDOTEMPCOTRIM(n) (((uint32_t)(n) << 17) & 0x001E0000)
#define AM_REG_INFO1_POWERSTATE3_CORELDOTEMPCOTRIM_Pos 17
#define AM_REG_INFO1_POWERSTATE3_CORELDOTEMPCOTRIM_Msk 0x001E0000
#define AM_REG_INFO1_POWERSTATE3_CORELDOACTTRIM_S 7
#define AM_REG_INFO1_POWERSTATE3_CORELDOACTTRIM_M 0x0001FF80
#define AM_REG_INFO1_POWERSTATE3_CORELDOACTTRIM(n) (((uint32_t)(n) << 7) & 0x0001FF80)
#define AM_REG_INFO1_POWERSTATE3_CORELDOACTTRIM_Pos 7
#define AM_REG_INFO1_POWERSTATE3_CORELDOACTTRIM_Msk 0x0001FF80
#define AM_REG_INFO1_POWERSTATE3_TVRGFACTTRIM_S 0
#define AM_REG_INFO1_POWERSTATE3_TVRGFACTTRIM_M 0x0000007F
#define AM_REG_INFO1_POWERSTATE3_TVRGFACTTRIM(n) (((uint32_t)(n) << 0) & 0x0000007F)
#define AM_REG_INFO1_POWERSTATE3_TVRGFACTTRIM_Pos 0
#define AM_REG_INFO1_POWERSTATE3_TVRGFACTTRIM_Msk 0x0000007F

