AmbiqAI/nnse/evb1/includes/extern/AmbiqSuite/R5.2.0/mcu/apollo5b/regs/am_mcu_apollo5b_mraminfo1.h
// POWERSTATE_RSVD_D3 - Power state reserved register
#define AM_REG_INFO1_POWERSTATE_RSVD_D3_RESVD_S 0
#define AM_REG_INFO1_POWERSTATE_RSVD_D3_RESVD_M 0xFFFFFFFF
#define AM_REG_INFO1_POWERSTATE_RSVD_D3_RESVD(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO1_POWERSTATE_RSVD_D3_RESVD_Pos 0
#define AM_REG_INFO1_POWERSTATE_RSVD_D3_RESVD_Msk 0xFFFFFFFF

// MEMLDOCONFIG - Memory LDO configuration fields
#define AM_REG_INFO1_MEMLDOCONFIG_RESVD_S 20
#define AM_REG_INFO1_MEMLDOCONFIG_RESVD_M 0xFFF00000
#define AM_REG_INFO1_MEMLDOCONFIG_RESVD(n) (((uint32_t)(n) << 20) & 0xFFF00000)
#define AM_REG_INFO1_MEMLDOCONFIG_RESVD_Pos 20
#define AM_REG_INFO1_MEMLDOCONFIG_RESVD_Msk 0xFFF00000
#define AM_REG_INFO1_MEMLDOCONFIG_DFLTMEMLDOACTTRIM_S 14
#define AM_REG_INFO1_MEMLDOCONFIG_DFLTMEMLDOACTTRIM_M 0x000FC000
#define AM_REG_INFO1_MEMLDOCONFIG_DFLTMEMLDOACTTRIM(n) (((uint32_t)(n) << 14) & 0x000FC000)
#define AM_REG_INFO1_MEMLDOCONFIG_DFLTMEMLDOACTTRIM_Pos 14
#define AM_REG_INFO1_MEMLDOCONFIG_DFLTMEMLDOACTTRIM_Msk 0x000FC000
#define AM_REG_INFO1_MEMLDOCONFIG_TVGRFPWLOFFSET_S 8
#define AM_REG_INFO1_MEMLDOCONFIG_TVGRFPWLOFFSET_M 0x00003F00
#define AM_REG_INFO1_MEMLDOCONFIG_TVGRFPWLOFFSET(n) (((uint32_t)(n) << 8) & 0x00003F00)
#define AM_REG_INFO1_MEMLDOCONFIG_TVGRFPWLOFFSET_Pos 8
#define AM_REG_INFO1_MEMLDOCONFIG_TVGRFPWLOFFSET_Msk 0x00003F00
#define AM_REG_INFO1_MEMLDOCONFIG_MEMLDOACTTRIM_S 2
#define AM_REG_INFO1_MEMLDOCONFIG_MEMLDOACTTRIM_M 0x000000FC
#define AM_REG_INFO1_MEMLDOCONFIG_MEMLDOACTTRIM(n) (((uint32_t)(n) << 2) & 0x000000FC)
#define AM_REG_INFO1_MEMLDOCONFIG_MEMLDOACTTRIM_Pos 2
#define AM_REG_INFO1_MEMLDOCONFIG_MEMLDOACTTRIM_Msk 0x000000FC
#define AM_REG_INFO1_MEMLDOCONFIG_MEMLDOD2ASPARE_S 0
#define AM_REG_INFO1_MEMLDOCONFIG_MEMLDOD2ASPARE_M 0x00000003
#define AM_REG_INFO1_MEMLDOCONFIG_MEMLDOD2ASPARE(n) (((uint32_t)(n) << 0) & 0x00000003)
#define AM_REG_INFO1_MEMLDOCONFIG_MEMLDOD2ASPARE_Pos 0
#define AM_REG_INFO1_MEMLDOCONFIG_MEMLDOD2ASPARE_Msk 0x00000003

#endif
